import java.util.LinkedList;
import java.util.Queue;

/**
 * 1、解析用户输入参数，根据不同参数走入不同逻辑
 * 2、正向转发场景 ： A拿到B权限，想访问C，但A直接访问不了C，B可以访问C，A可以访问B，此时在B上做一次转发，将流量从B转发到C即可
 * +---------+           +----------+          +---------+
 * |    A    |    ->     |    B     |   ->     |    C    |
 * +---------+           +----------+          +---------+
 *
 * A  ->   B   ->  C
 *
 * 3、反向转发场景：A拿到B权限，想访问C，A直接访问不了C，A也访问不了B，但是B可以访问A和C，在B上主动去连接 A 和 C，在他们之间转发流量
 *
 *  * +---------+           +----------+          +---------+
 *  * |    A    |    <-     |    B     |   ->     |    C    |
 *  * +---------+           +----------+          +---------+
 *
 *
 * A  <-   B   ->  C
 */

public class Main {
    public static void main(String[] args) {
        new Trans(10010, "127.0.0.1", 10012).start();
    }
}
